content/posts/reading_and_writing_inbox.md
+++
title = "Reading and Writing Inbox"
author = ["Jethro Kuan"]
draft = false
+++

This is a list of articles or books that I found interesting at some point in
time. Not all of them will be read: this is both impossible and unlikely. Some,
I will read in more detail, and others, I will read shallowly and refile
somewhere else.

To engage with the content I'm reading, rather than simply making annotations on
the content, I will also process the ideas presented into [evergreen notes]({{<relref "evergreen_notes.md" >}}). The
workflow is something like this.

1.  Read the piece of content, and make annotations on it (with [Hypothes.is](https://hypothes.is/)).
    These annotations go into a writing inbox.
2.  When I'm done with reading, take a look at the corresponding writing inbox,
    and process them into [evergreen notes]({{<relref "evergreen_notes.md" >}}). Mark annotations as processed once
    they are done, clearing the writing inbox.
3.  Mark the piece of content as done.

## The List {#the-list}

### <span class="org-todo todo TO_READ">TO-READ</span> [Context switching costs more than we give it credit for. - Thinking Through](https://thinkingthrough.substack.com/p/context-switching-cost-more-than) {#context-switching-costs-more-than-we-give-it-credit-for-dot-thinking-through}

### <span class="org-todo todo TO_READ">TO-READ</span> [Evergreen notes | Executable strategy for writing](https://notes.andymatuschak.org/Evergreen%5Fnotes?stackedNotes=z3PBVkZ2SvsAgFXkjHsycBeyS6Cw1QXf7kcD8) {#evergreen-notes-executable-strategy-for-writing}
